app/helpers/restaurants_helper.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 10]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 9]]
---
    def getAverageReview(restaurant)
        if restaurant.reviews.blank?
            0
        else
            restaurant.reviews.average(:rating).round(2)