app/views/restaurants/show.html.erb

            </h4>
            <p>Based on <%= @restaurant.reviews.count %> reviews</p>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 2]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 9]]