app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE (name LIKE '%club%' OR location LIKE '%club%') ORDER BY created_at DESC
---
    def index
        if params[:search]
            @restaurants = Restaurant.search(params[:search]).order("created_at DESC")

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 2]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 2]]
---
    def show
        if @restaurant.reviews.blank?
            @average_review = 0
        else
            @average_review = @restaurant.reviews.average(:rating).round(2)

INSERT INTO "restaurants" ("name", "description", "contactInfo", "created_at", "updated_at", "user_id", "location") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @restaurant = current_user.restaurants.build(restaurant_params)

        if @restaurant.save

UPDATE "restaurants" SET "location" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["location", "1006 State Route 36 Hornell, NY 14843"], ["updated_at", "2018-12-02 04:12:55.969536"], ["id", 11]]
---
    def update
        if @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def find_restaurant
            @restaurant = Restaurant.find(params[:id])