app/controllers/reviews_controller.rb

    def create
        @review = Review.new(review_params)
        @review.restaurant_id = @restaurant.id
        @review.user_id = current_user.id

        if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "restaurant_id") VALUES (?, ?, ?, ?, ?, ?)

        def find_restaurant
            @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]